Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.prod.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-stage"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.prod.module.eks.aws_eks_node_group.az_2a will be created
+ resource "aws_eks_node_group" "az_2a" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "jfp-eks-prod"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + node_group_name        = "jfp-eks-node-group-2a-prod"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::410965620680:role/terraform-eks-node-prod"
      + region                 = "us-east-2"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-036663ddfdb3b94b0",
          + "subnet-0b7c1e14af0ffb3ea",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 2
        }
    }

  # module.prod.module.eks.aws_eks_node_group.az_2a_ondemand will be destroyed
  # (because aws_eks_node_group.az_2a_ondemand is not in configuration)
- resource "aws_eks_node_group" "az_2a_ondemand" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-2:410965620680:nodegroup/jfp-eks-prod/jfp-eks-node-group-2a-prod/7acd18a3-4456-7779-8cf3-92acc932f358" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "jfp-eks-prod" -> null
      - disk_size              = 20 -> null
      - id                     = "jfp-eks-prod:jfp-eks-node-group-2a-prod" -> null
      - instance_types         = [
          - "t3.large",
        ] -> null
      - labels                 = {} -> null
      - node_group_name        = "jfp-eks-node-group-2a-prod" -> null
      - node_role_arn          = "arn:aws:iam::410965620680:role/terraform-eks-node-prod" -> null
      - region                 = "us-east-2" -> null
      - release_version        = "1.31.13-20251023" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-jfp-eks-node-group-2a-prod-7acd18a3-4456-7779-8cf3-92acc932f358"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-036663ddfdb3b94b0",
          - "subnet-0b7c1e14af0ffb3ea",
        ] -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version                = "1.31" -> null
        # (1 unchanged attribute hidden)

      - node_repair_config {
          - enabled = true -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 2 -> null
        }

      - update_config {
          - max_unavailable            = 2 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # module.prod.module.postgresql.aws_rds_cluster.default will be updated in-place
~ resource "aws_rds_cluster" "default" {
      + enable_local_write_forwarding         = false
      ~ engine_version                        = "13.20" -> "13.18"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (59 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod.module.postgresql.aws_rds_cluster_instance.default will be updated in-place
~ resource "aws_rds_cluster_instance" "default" {
      ~ engine_version                        = "13.20" -> "13.18"
      + force_destroy                         = false
        id                                    = "tf-20240604195536182300000003"
        tags                                  = {}
        # (32 unchanged 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.